In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
gdp_df = pd.read_csv("C:/Users/user/Documents/NSS_Projects/un-exploration-ndidiox/data/UNdata_Export_20230915_035202743.csv")

gdp_df

     Country or Area  Year        Value  Value Footnotes
0        Afghanistan  2020  1970.560169              NaN
1        Afghanistan  2019  2065.036235              NaN
2        Afghanistan  2018  2033.804389              NaN
3        Afghanistan  2017  2058.400221              NaN
4        Afghanistan  2016  2057.067978              NaN
...              ...   ...          ...              ...
7171        Zimbabwe  1994  2603.927369              NaN
7172        Zimbabwe  1993  2420.092791              NaN
7173        Zimbabwe  1992  2437.152908              NaN
7174        Zimbabwe  1991  2733.696626              NaN
7175        Zimbabwe  1990  2652.129209              NaN

[7176 rows x 4 columns]

In [22]:
# drop Value Footnotes Column
gdp_df = gdp_df.drop('Value Footnotes', axis=1)

# create list of new column names
gdp_df.set_axis(['Country', 'Year', 'GDP_Per_Capita'], axis='columns', inplace=True)

gdp_df

AttributeError: 'list' object has no attribute 'drop'